mosquitto/testing/1000_conn/report/statistics.json
{
  "MQTT Connect" : {
    "transaction" : "MQTT Connect",
    "sampleCount" : 1000,
    "errorCount" : 913,
    "errorPct" : 91.3,
    "meanResTime" : 5057.801999999998,
    "medianResTime" : 959.0,
    "minResTime" : 177.0,
    "maxResTime" : 10068.0,
    "pct1ResTime" : 10016.0,
    "pct2ResTime" : 10035.95,
    "pct3ResTime" : 10046.0,
    "throughput" : 91.21590805436468,
    "receivedKBytesPerSec" : 4.558301217732373,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3000,
    "errorCount" : 2739,
    "errorPct" : 91.3,
    "meanResTime" : 1689.5196666666661,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 10068.0,
    "pct1ResTime" : 10005.0,
    "pct2ResTime" : 10010.0,
    "pct3ResTime" : 10042.0,
    "throughput" : 273.64772416309404,
    "receivedKBytesPerSec" : 11.467460862674452,
    "sentKBytesPerSec" : 0.5579848125513089
  },
  "MQTT DisConnect" : {
    "transaction" : "MQTT DisConnect",
    "sampleCount" : 1000,
    "errorCount" : 913,
    "errorPct" : 91.3,
    "meanResTime" : 5.543000000000006,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 183.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 49.0,
    "pct3ResTime" : 108.0,
    "throughput" : 94.21518748822311,
    "receivedKBytesPerSec" : 2.5241205601092895,
    "sentKBytesPerSec" : 0.0
  },
  "MQTT Pub Sampler" : {
    "transaction" : "MQTT Pub Sampler",
    "sampleCount" : 1000,
    "errorCount" : 913,
    "errorPct" : 91.3,
    "meanResTime" : 5.213999999999998,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 340.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 47.0,
    "pct3ResTime" : 84.99000000000001,
    "throughput" : 94.20631182289213,
    "receivedKBytesPerSec" : 4.611785356806406,
    "sentKBytesPerSec" : 0.5762776731040979
  }
}