mosquitto/testing/1000_conn/report/statistics.json
{
  "MQTT Connect" : {
    "transaction" : "MQTT Connect",
    "sampleCount" : 1000,
    "errorCount" : 488,
    "errorPct" : 48.8,
    "meanResTime" : 5099.5709999999945,
    "medianResTime" : 1113.0,
    "minResTime" : 141.0,
    "maxResTime" : 10019.0,
    "pct1ResTime" : 10008.0,
    "pct2ResTime" : 10011.0,
    "pct3ResTime" : 10015.99,
    "throughput" : 91.18263882556761,
    "receivedKBytesPerSec" : 2.8914869608826477,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3000,
    "errorCount" : 1464,
    "errorPct" : 48.8,
    "meanResTime" : 1726.503000000001,
    "medianResTime" : 65.0,
    "minResTime" : 0.0,
    "maxResTime" : 10019.0,
    "pct1ResTime" : 10004.0,
    "pct2ResTime" : 10006.0,
    "pct3ResTime" : 10013.0,
    "throughput" : 273.5479164767028,
    "receivedKBytesPerSec" : 7.8680644205343295,
    "sentKBytesPerSec" : 3.2825749977204337
  },
  "MQTT DisConnect" : {
    "transaction" : "MQTT DisConnect",
    "sampleCount" : 1000,
    "errorCount" : 488,
    "errorPct" : 48.8,
    "meanResTime" : 40.95999999999997,
    "medianResTime" : 41.0,
    "minResTime" : 0.0,
    "maxResTime" : 411.0,
    "pct1ResTime" : 82.89999999999998,
    "pct2ResTime" : 97.94999999999993,
    "pct3ResTime" : 360.99,
    "throughput" : 94.93070058857033,
    "receivedKBytesPerSec" : 1.834090801215113,
    "sentKBytesPerSec" : 0.0
  },
  "MQTT Pub Sampler" : {
    "transaction" : "MQTT Pub Sampler",
    "sampleCount" : 1000,
    "errorCount" : 488,
    "errorPct" : 48.8,
    "meanResTime" : 38.97800000000001,
    "medianResTime" : 39.0,
    "minResTime" : 0.0,
    "maxResTime" : 443.0,
    "pct1ResTime" : 94.89999999999998,
    "pct2ResTime" : 106.0,
    "pct3ResTime" : 326.98,
    "throughput" : 94.45546424860677,
    "receivedKBytesPerSec" : 3.330293048077831,
    "sentKBytesPerSec" : 3.4003967129498442
  }
}