mosquitto/testing/1000_conn/report/statistics.json
{
  "MQTT Connect" : {
    "transaction" : "MQTT Connect",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6850.064000000004,
    "medianResTime" : 1221.5,
    "minResTime" : 158.0,
    "maxResTime" : 32567.0,
    "pct1ResTime" : 11397.5,
    "pct2ResTime" : 19105.0,
    "pct3ResTime" : 32366.21,
    "throughput" : 29.945499191471523,
    "receivedKBytesPerSec" : 0.3216801670958855,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2330.4079999999994,
    "medianResTime" : 78.0,
    "minResTime" : 36.0,
    "maxResTime" : 32567.0,
    "pct1ResTime" : 11146.0,
    "pct2ResTime" : 11192.499999999998,
    "pct3ResTime" : 31477.209999997278,
    "throughput" : 89.58967926894822,
    "receivedKBytesPerSec" : 1.2248588962551514,
    "sentKBytesPerSec" : 2.099758107865974
  },
  "MQTT DisConnect" : {
    "transaction" : "MQTT DisConnect",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 61.01299999999998,
    "medianResTime" : 53.0,
    "minResTime" : 36.0,
    "maxResTime" : 386.0,
    "pct1ResTime" : 87.0,
    "pct2ResTime" : 91.94999999999993,
    "pct3ResTime" : 107.98000000000002,
    "throughput" : 30.235230090100984,
    "receivedKBytesPerSec" : 0.3247925107335067,
    "sentKBytesPerSec" : 0.0
  },
  "MQTT Pub Sampler" : {
    "transaction" : "MQTT Pub Sampler",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 80.14700000000003,
    "medianResTime" : 64.5,
    "minResTime" : 36.0,
    "maxResTime" : 906.0,
    "pct1ResTime" : 102.0,
    "pct2ResTime" : 121.89999999999986,
    "pct3ResTime" : 378.83000000000015,
    "throughput" : 30.21330593993595,
    "receivedKBytesPerSec" : 0.590103631639374,
    "sentKBytesPerSec" : 2.1243730739017463
  }
}